/******************************************************************************
 *
 * [引擎核心图纸] GAME.H  -- (Day 09 封版：战败与轮回系统)
 *
 * @desc  : 游戏全局导演类的头文件声明。定义了游戏的核心实体与生命周期控制。
 *
 ******************************************************************************/
#pragma once

 // --- 核心组件依赖 ---
#include "player.h"
#include "enemy.h"
#include "effect_manager.h"
#include "map.h"

class Game {
private:
    // ==========================================
    // [ 演员与系统管家 ]
    // ==========================================
    Player player;                // 玩家实体 (盲剑客)
    Enemy enemy;                  // 敌方实体 (沙袋/猎犬)
    EffectManager effectManager;  // 特效渲染与屏幕震动管家
    Map levelMap;                 // 关卡物理地图与碰撞网格

    // ==========================================
    // 💥 新增：用来记住地图里的真实出生点
    // ==========================================
    Vector2D spawnPosPlayer;
    Vector2D spawnPosEnemy;

    // ==========================================
    // [ 引擎状态锁 ]
    // ==========================================
    bool isRunning;               // 游戏主循环开关
    bool isGameOver;              // 战败 (落命) 状态锁

    // ==========================================
    // [ 内部隐秘机制 ]
    // ==========================================
    // 物理：极速斩杀碰撞检测 (线段 AB 与圆心 center 的相交判定)
    bool CheckCollision(Vector2D A, Vector2D B, Vector2D center, float r);

    // 轮回：重置游戏状态 (踢回老家、复活敌人、清空视觉残留)
    void ResetGame();

public:
    // ==========================================
    // [ 导演公开接口 (生命周期) ]
    // ==========================================
    Game();                       // 构造：加载地图文件，初始化实体坐标
    void Run();                   // 启动引擎：接管 16ms 帧率控制

    void Update();                // 单帧逻辑：调度 AI、物理、双重雷达、死亡判定
    void Draw();                  // 单帧渲染：图层叠加绘制、全屏受击与战败 UI
};